app/controllers/api/v1/bargain_controller.rb

SELECT  "bargains".* FROM "bargains" WHERE "bargains"."channel_id" = $1 LIMIT $2  [["channel_id", "for_api_test"], ["LIMIT", 1]]
INSERT INTO "bargains" ("channel_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["channel_id", "for_api_test"], ["created_at", "2019-03-12 12:57:07.125499"], ["updated_at", "2019-03-12 12:57:07.125499"]]
---
    def index(set_time = 3)#單位 分鐘
        channel_id = params[:channel_id]
        bargain = Bargain.find_by(channel_id: channel_id)
        if bargain.nil?#新開局
            Bargain.start(channel_id)
            bargain = Bargain.find_by(channel_id: channel_id)
            BargainSetTimeJob.set(wait: set_time.minutes).perform_later(channel_id)
        end
        reciprocal = bargain.created_at.to_i + set_time*60 - Time.now.to_i