app/controllers/api/v1/bargain_controller.rb

SELECT  "bargains".* FROM "bargains" WHERE "bargains"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @bargain = Bargain.find(params[:id])