app/models/bargain.rb

    def self.start(channel_id)
      bargain = Bargain.find_or_create_by(channel_id: channel_id)
      bargain.update(all_bid: [99999999]) if bargain.all_bid.empty? #api模式 一進入頁面就初始化
---
INSERT INTO "bargains" ("channel_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["channel_id", "for_api_test"], ["created_at", "2019-03-12 12:57:07.125499"], ["updated_at", "2019-03-12 12:57:07.125499"]]
SELECT  "bargains".* FROM "bargains" WHERE "bargains"."channel_id" = $1 LIMIT $2  [["channel_id", "for_api_test"], ["LIMIT", 1]]
UPDATE "bargains" SET "all_bid" = $1, "updated_at" = $2 WHERE "bargains"."id" = $3  [["all_bid", "{99999999}"], ["updated_at", "2019-03-12 12:57:07.137485"], ["id", 3]]

    def self.check(channel_id, message, user_name)
      game = Bargain.find_by(channel_id: channel_id)
      all_bid = game.all_bid.map(&:to_i)
      if all_bid.find {|n| n == message}.nil?
        not_uniq = all_bid.select {|n| all_bid.count(n) > 1 }
        uniq_bid = all_bid - not_uniq
        if uniq_bid.min > message
          game.update(now_win_bid: message, now_winner: user_name)
          result = "恭喜您，您的出價 #{message} 元目前是最低價且唯一的那位喔"
        else
          uniq_bid << message
          x = uniq_bid.sort.index(message)
          result = "你目前是 #{message} 元這個價位唯一的出價者，但不是最低的那一位，比您低的還有 #{x} 位"
        end
      else
        result  = "您的出價 #{message} 元，跟人重複囉"
      end
      bid = all_bid << message
      game.update(all_bid: bid)
---
SELECT  "bargains".* FROM "bargains" WHERE "bargains"."channel_id" = $1 LIMIT $2  [["channel_id", "for_api_test"], ["LIMIT", 1]]
UPDATE "bargains" SET "all_bid" = $1, "updated_at" = $2 WHERE "bargains"."id" = $3  [["all_bid", "{99999999,11}"], ["updated_at", "2019-03-12 12:58:19.542151"], ["id", 3]]